tap "cargo-lambda/tap", "https://github.com/cargo-lambda/homebrew-tap.git", trusted: true
# Command-line interface for SQLite
brew "sqlite"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Distributed revision control system
brew "git"
# CLI for Infisical
brew "infisical"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Mac App Store command-line interface
brew "mas"
# Deep clean and optimize your Mac
brew "mole"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Modern API client that lives in your terminal
brew "posting"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Formatting technology for Swift source code
brew "swift-format"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Official tldr client written in Rust
brew "tlrc"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Cargo Lambda is a Cargo subcommand to help you work with AWS Lambda.
brew "cargo-lambda/tap/cargo-lambda"
# Image editing and design software
cask "affinity"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# Universal chat app powered by Matrix
cask "beeper"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Databases and SQL IDE
cask "datagrip"
# Voice and text chat software
cask "discord"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source RSS reader
cask "netnewswire"
# VPN client focusing on security
cask "protonvpn"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Open-source code editor
cask "visual-studio-code"
# Messaging and calling application
cask "zalo"
mas "Command X", id: 6448461551
mas "DaVinci Resolve", id: 571213070
mas "Keynote", id: 361285480
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 361304891
mas "OneDrive", id: 823766827
mas "Pages", id: 361309726
mas "ReTab", id: 6736950080
mas "uBlock Origin Lite", id: 6745342698
mas "Xcode", id: 497799835
vscode "atommaterial.a-file-icon-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "cweijan.vscode-office"
vscode "dmitrydorofeev.empty-indent"
vscode "esbenp.prettier-vscode"
vscode "gitlab.gitlab-workflow"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "repreng.csv"
vscode "streetsidesoftware.code-spell-checker"
vscode "subframe7536.custom-ui-style"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
