tap "cargo-lambda/cargo-lambda"
brew "sqlite"
brew "awscli"
brew "cowsay"
brew "docker"
brew "duckdb"
brew "eza"
brew "fastfetch"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "mas"
brew "mole"
brew "neofetch"
brew "neovim"
brew "posting"
brew "starship"
brew "stow"
brew "swift-format"
brew "swiftlint"
brew "tlrc"
brew "uv"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
cask "affinity"
cask "antigravity-cli"
cask "beeper"
cask "bitwarden"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cloudflare-warp"
cask "codex"
cask "datagrip"
cask "discord"
cask "docker-desktop"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-gemini"
cask "grandperspective"
cask "jordanbaird-ice"
cask "latest"
cask "raycast"
cask "scroll-reverser"
cask "visual-studio-code"
cask "zalo"
cask "zed"
cask "zen"
mas "Command X", id: 6448461551
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "PDFgear", id: 6469021132
mas "Xcode", id: 497799835
vscode "atommaterial.a-file-icon-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "cweijan.vscode-office"
vscode "dmitrydorofeev.empty-indent"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.remotehub"
vscode "gitlab.gitlab-workflow"
vscode "hediet.vscode-drawio"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-repositories"
vscode "nichabosh.minimalist-dark"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "repreng.csv"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "subframe7536.custom-ui-style"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vue.volar"
npm "@datadog/cli"
